Find the top 1 student in each subject (highest marks), and show only:

Name

Subject

Marks

So the final result should only show Alex for Math and Sara for Science.

In [2]:
import pandas as pd  

data = {
    "Name": ["Ali", "Sara", "John", "Mary", "Alex"],
    "Subject": ["Math", "Science", "Math", "Science", "Math"],
    "Marks": [85, 92, 78, 88, 95]
}

df = pd.DataFrame(data)
df

   Name  Subject  Marks
0   Ali     Math     85
1  Sara  Science     92
2  John     Math     78
3  Mary  Science     88
4  Alex     Math     95

In [3]:
index = df.groupby("Subject")["Marks"].idxmax() #Find the first index with maximum marks for each subject

In [4]:
index

Subject
Math       4
Science    1
Name: Marks, dtype: int64

In [5]:
df.loc[index] #Values in those index

   Name  Subject  Marks
4  Alex     Math     95
1  Sara  Science     92